Horion0415/esp-bsp/examples/p4_eye_product_test/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_ENABLE_PRINT_FPS_RATE_VALUE=n
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_USE_MULTINET=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=n
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_CAMERA_OV2710=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=9
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=27
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=28
CONFIG_ESP_HOSTED_SDIO_PIN_D0=29
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=30
CONFIG_ESP_HOSTED_SDIO_PIN_D2=31
CONFIG_ESP_HOSTED_SDIO_PIN_D3=32
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_SPRINTF_CUSTOM=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
